public class Summary {

    public static void main(String[] args) {

        /**
         * 변수 이름은 일반적으로 명사를 사용
         *
         */

        /**
         * 메서드 사용의 장점
         * 1. 코드 재사용
         * 2. 코드의 가독성
         * 3. 모듈성 : 작은 단위로 나눌 수 있음
         * 4. 코드 유지 관리 : 문제 발생 부분만 수정하면 됨
         * 5. 재사용성과 확장성 : 공통서비스
         * 6. 추상화 : 메서드 사용처에서는 메서드의 구현을 몰라도 됨(분업 가능)
         * 7, 테스트와 디버깅 용이성 : 개별 메서드는 독립적으로 테스트하고 디버그할 수 있음
         */

        /**
         * 메서드 호출시 인수(Argument) 와 매개변수(Parameter)
         *  인수(인자) : 넘기는 값
         *  매개변수 : 받는 값
         */

        /**
         * 자바는 항상 변수의 값을 복사해서 대입한다
         * 자바는 항상 변수의 값을 복사해서 대입한다
         * 자바는 항상 변수의 값을 복사해서 대입한다
         * 자바는 항상 변수의 값을 복사해서 대입한다
         * 자바는 항상 변수의 값을 복사해서 대입한다
         * 자바는 항상 변수의 값을 복사해서 대입한다
         * int num2 = num1; // num1의 '값'을 num2에 '복사'해서 대입한다.
         */

        /**
         * 메서드 시그니쳐 : 자바에서 메서드를 구분할 수 있는 고유한 식별자나 서명 
         *  - 메서드 이름 + 매개변수 타입(순서)
         * 
         */

    }
}
